<a href="https://colab.research.google.com/github/virf96/Basico/blob/main/Transformaci%C3%B3n_entr%C3%B3pica.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [17]:
df=pd.read_csv("/content/drive/MyDrive/datasets/titanic.csv")

<h1 style="color:orange">Evento -- 1 (sobreviviente)  NO Evento --- 0 (no sobreviviente)</h1>

In [18]:
df

      pclass  survived  ...   body                        home.dest
0          1         1  ...    NaN                     St Louis, MO
1          1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3          1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1304       3         0  ...  328.0                              NaN
1305       3         0  ...    NaN                              NaN
1306       3         0  ...  304.0                              NaN
1307       3         0  ...    NaN                              NaN
1308       3         0  ...    NaN                              NaN

[1309 rows x 14 columns]

<h1 style="color:orange">DUPLICADOS </h1>

In [19]:
df.duplicated().sum()

0

<h1 style="color:orange">RENOMBRAR COLUMNAS </h1>

In [20]:
id_feats=["home.dest"]
v_feats=["pclass","sex","sibSp","parch","embarked",'body']
c_feats=["age","fare",'boat']
t_feats=["cabin","name","ticket"]
tgt_feat=["survived"]

id_feats_new=list(map(lambda x:"id_"+x,id_feats))
v_feats_new=list(map(lambda x:"v_"+x,v_feats))
c_feats_new=list(map(lambda x:"c_"+x,c_feats))
t_feats_new=list(map(lambda x:"t_"+x,t_feats))
tgt_feat_new=list(map(lambda x:"tgt_"+x,tgt_feat))

In [21]:
df.rename(columns=dict(zip(id_feats,id_feats_new)),inplace=True)
df.rename(columns=dict(zip(v_feats,v_feats_new)),inplace=True)
df.rename(columns=dict(zip(c_feats,c_feats_new)),inplace=True)
df.rename(columns=dict(zip(t_feats,t_feats_new)),inplace=True)
df.rename(columns=dict(zip(tgt_feat,tgt_feat_new)),inplace=True)

In [22]:
df

      v_pclass  tgt_survived  ... v_body                     id_home.dest
0            1             1  ...    NaN                     St Louis, MO
1            1             1  ...    NaN  Montreal, PQ / Chesterville, ON
2            1             0  ...    NaN  Montreal, PQ / Chesterville, ON
3            1             0  ...  135.0  Montreal, PQ / Chesterville, ON
4            1             0  ...    NaN  Montreal, PQ / Chesterville, ON
...        ...           ...  ...    ...                              ...
1304         3             0  ...  328.0                              NaN
1305         3             0  ...    NaN                              NaN
1306         3             0  ...  304.0                              NaN
1307         3             0  ...    NaN                              NaN
1308         3             0  ...    NaN                              NaN

[1309 rows x 14 columns]

<h1 style="color:orange">COMPLETITUD </h1>

In [23]:
completitud=pd.DataFrame((1-df.isnull().sum()/df.shape[0])*100).reset_index().rename(columns={"index":"columna",0:"completitud"})

In [24]:
completitud

         columna  completitud
0       v_pclass   100.000000
1   tgt_survived   100.000000
2         t_name   100.000000
3          v_sex   100.000000
4          c_age    79.908327
5          sibsp   100.000000
6        v_parch   100.000000
7       t_ticket   100.000000
8         c_fare    99.923606
9        t_cabin    22.536287
10    v_embarked    99.847212
11        c_boat    37.127578
12        v_body     9.243697
13  id_home.dest    56.913675

<h1 style="color:orange">ELIMINAR COLUMNAS </h1>

In [26]:
df.drop(columns=["t_cabin",'c_boat','v_body','id_home.dest'],inplace=True)

In [27]:
df.head()

   v_pclass  tgt_survived  ...    c_fare v_embarked
0         1             1  ...  211.3375          S
1         1             1  ...  151.5500          S
2         1             0  ...  151.5500          S
3         1             0  ...  151.5500          S
4         1             0  ...  151.5500          S

[5 rows x 10 columns]

<h1 style="color:orange">CONTINUAS A DISCRETAS </h1>

In [28]:
df.filter(like="c_")

        c_age    c_fare
0     29.0000  211.3375
1      0.9167  151.5500
2      2.0000  151.5500
3     30.0000  151.5500
4     25.0000  151.5500
...       ...       ...
1304  14.5000   14.4542
1305      NaN   14.4542
1306  26.5000    7.2250
1307  27.0000    7.2250
1308  29.0000    7.8750

[1309 rows x 2 columns]

In [30]:
pd.cut(df["c_age"],bins=3).astype(str).value_counts(1)

(26.778, 53.389]    0.378151
(0.0869, 26.778]    0.362108
nan                 0.200917
(53.389, 80.0]      0.058824
Name: c_age, dtype: float64

In [32]:
df["v_age"]=pd.cut(df["c_age"],bins=3).astype(str)

In [33]:
df["v_age"].unique()

array(['(26.778, 53.389]', '(0.0869, 26.778]', '(53.389, 80.0]', 'nan'],
      dtype=object)

In [35]:
df["v_age"]=df["v_age"].replace({"nan":"Missings"})

In [36]:
pd.cut(df["c_fare"],bins=3).astype(str).value_counts(1)

(-0.512, 170.776]     0.970206
(170.776, 341.553]    0.025974
(341.553, 512.329]    0.003056
nan                   0.000764
Name: c_fare, dtype: float64

In [37]:
df["v_fare"]=pd.cut(df["c_fare"],bins=3).astype(str)

<h1 style="color:orange">CREAR CATEGORIA MISSINGS</h1>

In [38]:
df["v_embarked"]=df["v_embarked"].fillna("Missings")

<h1 style="color:orange">TRAIN Y TEST</h1>

In [39]:
from sklearn.model_selection import train_test_split

In [40]:
df.filter(like="v_").columns

Index(['v_pclass', 'v_sex', 'v_parch', 'v_embarked', 'v_age', 'v_fare'], dtype='object')

In [43]:
df.columns

Index(['v_pclass', 'tgt_survived', 't_name', 'v_sex', 'c_age', 'sibsp',
       'v_parch', 't_ticket', 'c_fare', 'v_embarked', 'v_age', 'v_fare'],
      dtype='object')

In [44]:
X=df[['v_pclass', 'v_sex',  'v_parch', 'v_embarked', 'v_age',
       'v_fare',"tgt_survived"]]

In [45]:
X_train,X_test=train_test_split(X,random_state=0)

<h1 style="color:orange">WOE</h1>

In [47]:
X_test["v_sex"].value_counts()

male      217
female    111
Name: v_sex, dtype: int64

In [48]:
X_train["v_sex"].value_counts()

male      626
female    355
Name: v_sex, dtype: int64

In [49]:
df["v_fare"].value_counts()

(-0.512, 170.776]     1270
(170.776, 341.553]      34
(341.553, 512.329]       4
nan                      1
Name: v_fare, dtype: int64

## WOE

<h1 style="color:orange">Calcule el número de eventos y no eventos en cada grupo (bin)</h1>

### SEX

In [51]:
X_train[X_train["v_sex"]=="male"]["tgt_survived"].value_counts()

0    506
1    120
Name: tgt_survived, dtype: int64

In [52]:
aux=X_train[["v_sex","tgt_survived"]].groupby("v_sex").agg(["count","sum"])

In [53]:
aux

       tgt_survived
              count  sum
v_sex
female          355  260
male            626  120

In [55]:
aux["no_evento"]=aux["tgt_survived","count"]-aux["tgt_survived","sum"]
aux["evento"]=aux["tgt_survived","sum"]

In [56]:
aux

       tgt_survived      no_evento evento
              count  sum
v_sex
female          355  260        95    260
male            626  120       506    120

In [57]:
aux["evento%"]=aux["evento"]/aux["evento"].sum()
aux["no_evento%"]=aux["no_evento"]/aux["no_evento"].sum()

In [58]:
aux

       tgt_survived      no_evento evento   evento% no_evento%
              count  sum
v_sex
female          355  260        95    260  0.684211    0.15807
male            626  120       506    120  0.315789    0.84193

In [59]:
aux["WOE"]=np.log(aux["evento%"]/aux["no_evento%"])

In [60]:
aux

       tgt_survived      no_evento evento   evento% no_evento%       WOE
              count  sum
v_sex
female          355  260        95    260  0.684211    0.15807  1.465228
male            626  120       506    120  0.315789    0.84193 -0.980621

In [61]:
aux["IV"]=(aux["evento%"]-aux["no_evento%"])*aux["WOE"]

In [62]:
aux["IV"].sum()

1.2868609153909978

In [63]:
aux=aux[["WOE"]].reset_index().rename(columns={"WOE":"W_v_sex"})

In [64]:
aux

    v_sex   W_v_sex

0  female  1.465228
1    male -0.980621

In [65]:
X_train=X_train.merge(aux,on="v_sex",how="left")

/usr/local/lib/python3.6/dist-packages/pandas/core/reshape/merge.py:643: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)
/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:3889: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.
  obj = obj._drop_axis(labels, axis, level=level, errors=errors)

In [67]:
X_test=X_test.merge(aux,on="v_sex",how="left")

/usr/local/lib/python3.6/dist-packages/pandas/core/reshape/merge.py:643: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)
/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:3889: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.
  obj = obj._drop_axis(labels, axis, level=level, errors=errors)

In [68]:
X_test

     v_pclass   v_sex  v_parch  ...             v_fare tgt_survived (W_v_sex, )
0           3    male        0  ...  (-0.512, 170.776]            0   -0.980621
1           2  female        1  ...  (-0.512, 170.776]            1    1.465228
2           2    male        0  ...  (-0.512, 170.776]            0   -0.980621
3           3    male        0  ...  (-0.512, 170.776]            0   -0.980621
4           2    male        0  ...  (-0.512, 170.776]            0   -0.980621
..        ...     ...      ...  ...                ...          ...         ...
323         2    male        0  ...  (-0.512, 170.776]            0   -0.980621
324         2  female        1  ...  (-0.512, 170.776]            1    1.465228
325         3    male        0  ...  (-0.512, 170.776]            0   -0.980621
326         3  female        5  ...  (-0.512, 170.776]            1    1.465228
327         3    male        0  ...  (-0.512, 170.776]            0   -0.980621

[328 rows x 8 columns]

### AGE

In [70]:
aux = X_train[["v_age", "tgt_survived"]].groupby("v_age").agg(["count", "sum"])


aux["evento"] = aux["tgt_survived", "sum"]

aux

aux["no_evento"] = aux["tgt_survived", "count"] - aux["tgt_survived", "sum"]

aux["evento"].sum()

aux["%evento"] = aux["evento"] / aux["evento"].sum()

aux["%no_evento"] = aux["no_evento"] / aux["no_evento"].sum()

aux["WOE"] = np.log(aux["%evento"]/aux["%no_evento"])




aux["IV"] = (aux["%evento"]-aux["%no_evento"])*aux["WOE"]

aux["IV"].sum()

aux=aux[["WOE"]].reset_index().rename(columns={"WOE": f"W_v_age"})

aux.columns=["v_age","W_v_age"]

X_train=X_train.merge(aux, on="v_age", how="left")
X_test=X_test.merge(aux, on="v_age", how="left")

X_train

     v_pclass   v_sex  v_parch  ... tgt_survived (W_v_sex, )   W_v_age
0           3    male        2  ...            0   -0.980621  0.103148
1           2    male        0  ...            0   -0.980621  0.103148
2           1  female        2  ...            1    1.465228  0.166206
3           2    male        0  ...            0   -0.980621  0.103148
4           3    male        0  ...            0   -0.980621  0.166206
..        ...     ...      ...  ...          ...         ...       ...
976         3  female        2  ...            1    1.465228  0.103148
977         3    male        0  ...            0   -0.980621 -0.517586
978         3  female        0  ...            1    1.465228 -0.517586
979         2  female        0  ...            1    1.465228  0.103148
980         3  female        1  ...            0    1.465228  0.166206

[981 rows x 9 columns]

In [71]:
X_train["W_v_age"].value_counts()

 0.166206    386
 0.103148    347
-0.517586    190
-0.183430     58
Name: W_v_age, dtype: int64